
&НаСервере
Процедура ЗагрузитьДанныеОбученияНаСервере(Адрес)
	
	СправочникОбъект = РеквизитФормыВЗначение("Объект");
	СправочникОбъект.ЗагрузитьДанныеОбучения(Адрес);
	ЗначениеВРеквизитФормы(СправочникОбъект, "Объект");
	ОбновитьОтображение();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеОбучения(Команда)
	
	Если ХранилищеЗаполнено() Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, "Данные обучения уже загружены. Заменить?",РежимДиалогаВопрос.ДаНет, 60); 
	Иначе	
		НачатьЗаполнениеДанныхОбучения();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		НачатьЗаполнениеДанныхОбучения();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьЗаполнениеДанныхОбучения()
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Показать(Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтотОбъект));
	
КонецПроцедуры
 
&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		
		ДД = Новый ДвоичныеДанные(ВыбранноеЗначение[0]);
		
		Адрес = ПоместитьВоВременноеХранилище(ДД);
		ЗагрузитьДанныеОбученияНаСервере(Адрес);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ХранилищеЗаполнено()
	
	Возврат РеквизитФормыВЗначение("Объект").ДанныеОбучения.Получить() <> Неопределено;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// временный костыль
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ВидВходаНейрона = ПланыВидовХарактеристик.ВидыВходовНейрона.Униграммы;
	КонецЕсли; 
	
	ОбновитьОтображение();
	 	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображение()
	
	Если Не ХранилищеЗаполнено() Тогда
		Элементы.СтатусЗаполненияДанныхОбучения.Заголовок = "Данные обучения не заполнены!";
	КонецЕсли;
	
КонецПроцедуры
 

&НаКлиенте
Процедура СтатусЗаполненияДанныхОбученияНажатие(Элемент)
	
	ЗагрузитьДанныеОбучения(Неопределено);
	
КонецПроцедуры
 