Функция СоздатьИЗаполнить(Параметры) Экспорт

	Док = Документы.Операция.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(Док, Параметры);
	
	Попытка
		Док.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьСвойстваДокументаНаОснованииСтруктурыОперации(ПараметрыОперации) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Пользователь", ПараметрыОперации.Отправитель);
	Результат.Вставить("ТипОперации", ПараметрыОперации.Команда);
	Результат.Вставить("Статья", ПараметрыОперации.Статья);  
	Результат.Вставить("Сумма", ПараметрыОперации.СуммыСообщения[0]);
	Результат.Вставить("Дата", ПараметрыОперации.ДатаСообщения);
	Результат.Вставить("ВидСредств", ПараметрыОперации.ВидСредств);
	
	Возврат Результат;
	
КонецФункции
 