Функция СоздатьИЗаполнить(Пользователь, Приход, Сумма, Статья, БезНал, Дата, Перемещение = Ложь) Экспорт
			
	Док = Документы.Операция.СоздатьДокумент();
	Док.Пользователь = Пользователь;
	Док.ТипОперации = ?(Перемещение,Перечисления.ТипыОпераций.Перемещение, ?(Приход, Перечисления.ТипыОпераций.Приход, Перечисления.ТипыОпераций.Расход));
	Док.Статья = Статья;
	Док.Сумма = Сумма;
	Док.Дата = Дата;
	Док.ВидСредств = ?(БезНал, Перечисления.ВидыСредств.Безналичные, Перечисления.ВидыСредств.Наличные);
	
	Попытка
		Док.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции
