
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Средства.Записывать = Истина;
	Движение = Движения.Средства.Добавить();
	Движение.ВидДвижения = ?(ТипОперации = Перечисления.ТипыОпераций.Приход, ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход);
	Движение.Статья = Статья;
	Движение.Период = Дата;
	Движение.Пользователь = Пользователь;
	Движение.Кошелек = Кошелек;
	Движение.Сумма = Сумма;
	Движение.ТипОперации = ТипОперации;
	Движение.ВидСредств = ВидСредств;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И ТипОперации = Перечисления.ТипыОпераций.Расход Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
		Запрос.УстановитьПараметр("ВидСредств", ВидСредств);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СредстваОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.Средства.Остатки(&МоментВремени, ВидСредств = &ВидСредств) КАК СредстваОстатки";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Остаток = 0;
		Иначе
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			Остаток = Выборка.СуммаОстаток;
		КонецЕсли; 
		
		Если Сумма > Остаток Тогда
			Отказ = Истина;
			Сообщить("Недостаточно средств! Остаток = " + Остаток);
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры
