
Процедура ОбработатьКомандыРегламент() Экспорт
	
	ОбменТелеграмСервер.ОбработатьКоманды(); 
		
КонецПроцедуры

Процедура ОтправитьЕжедневныйОтчетРегламент() Экспорт
	
	ТекДата = ТекущаяДатаСеанса();
	
	ОбменТелеграмСервер.ОтправитьОтчетЗаПериод(НачалоДня(ТекДата),ТекДата); 
	
КонецПроцедуры

Процедура ОтправитьЕжемесячныйОтчетРегламент() Экспорт
	
	ТекДата = ТекущаяДатаСеанса();
	
	ОбменТелеграмСервер.ОтправитьОтчетЗаПериод(НачалоМесяца(ТекДата),ТекДата);
	
КонецПроцедуры
  
