
Процедура ОбработатьКомандыРегламент() Экспорт
	
	ОбменТелеграмСервер.ОбработатьКоманды(); 
		
КонецПроцедуры

Процедура ОтправитьЕжедневныйОтчетРегламент() Экспорт
	
	ТекДата = ТекущаяДатаСеанса();
	
	ОбменТелеграмСервер.ОтправитьОтчетЗаПериод(НачалоДня(ТекДата),ТекДата); 
	
КонецПроцедуры

Процедура ОтправитьЕжемесячныйОтчетРегламент() Экспорт
	
	ТекДата = ТекущаяДатаСеанса();
	
	ОбменТелеграмСервер.ОтправитьОтчетЗаПериод(НачалоМесяца(ТекДата),ТекДата);
	
КонецПроцедуры

Процедура ОбновитьДанныеПроксиРегламент() Экспорт
	
	КоличествоПрокси = Константы.МинимальныйОстатокПрокси.Получить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(1) КАК Количество
	|ИЗ
	|	Справочник.Прокси КАК Прокси
	|
	|СГРУППИРОВАТЬ ПО
	|	Прокси.Ссылка";
	Результат = Запрос.Выполнить().Выбрать();
	Результат.Следующий();
	
	Если КоличествоПрокси >= Результат.Количество Тогда
		СлужебныеПроцедурыСервер.ОбновитьПрокси();		
	КонецЕсли; 
	 
КонецПроцедуры
  
