Перем ЭтоНовый;

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаДокумента = Товары.Итог("Сумма");
	
	ЭтоНовый = ЭтоНовый();
 
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если ЭтоНовый Тогда
		
		ТЗТовары = Товары.Выгрузить(,"Статья,Сумма");
		ТЗТовары.Свернуть("Статья","Сумма");
		
		Для Каждого Товар Из ТЗТовары Цикл
			Отказ = Не Документы.Операция.СоздатьИЗаполнить(Пользователь, Ложь, Товар.Сумма, Товар.Статья, Безнал, Дата);
		КонецЦикла; 
		
	КонецЕсли; 
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Движения.КупленныеТовары.Записывать = Истина;
	Для Каждого Товар Из Товары Цикл
		Движение = Движения.КупленныеТовары.Добавить();
		Движение.Период = Дата;
		Движение.Пользователь = Пользователь;
		Движение.Товар = Товар.Товар;
		Движение.Статья = Товар.Статья;
		Движение.Цена = Товар.Цена;
		Движение.Количество = Товар.Количество;
		Движение.Сумма = Товар.Сумма;
	КонецЦикла;
	
КонецПроцедуры
