
&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.Основное Тогда
		Успешно = ПроверкаЧеков.АвторизацияФНС(Объект.Email, Объект.ИмяПользователя, Объект.Телефон);
		Если Успешно Тогда
			Сообщить("На ваш номер телефона отправлено СМС. Введите его в графе Пароль");
			Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПароль;
			Элементы.Выполнить.Заголовок = "Завершить";
		Иначе
			Сообщить("Пользователь уже существует! Введите данные напрямую в регистр");
		КонецЕсли;
	Иначе
		Если Не ЗначениеЗаполнено(Объект.Пароль) Тогда
			Сообщить("Введите полученный в СМС пароль!");
			Возврат;
		Иначе
			СоздатьЗаписьРегистра();
			Сообщить("Данные сохранены!");
			Закрыть();
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаписьРегистра()
	
	Запись = РегистрыСведений.ДанныеАвторизацииФНС.СоздатьМенеджерЗаписи();
	Запись.Пользователь = Справочники.Пользователи.НайтиПоРеквизиту("ИдентификаторПользователяИБ",
						  ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор);
	Запись.Email = Объект.Email;
	Запись.Телефон = Объект.Телефон;
	Запись.ИмяПользователя = Объект.ИмяПользователя;
	Запись.Пароль = Объект.Пароль;
	Запись.Записать();
	
КонецПроцедуры
 