
#Область ПрограммныйИнтерфейс

Функция ПереобразоватьВЮникод(Знач Строка) Экспорт

    
    ГотововаяСтрока = "" ;
    
    МасРус = Новый Массив(66) ;
    
    МасРус[0]="А";   МасРус[1]="Б";  МасРус[2]="В";  МасРус[3]="Г";  МасРус[4]="Д";  МасРус[5]="Е";
    МасРус[6]="Ё";   МасРус[7]="Ж";  МасРус[8]="З";  МасРус[9]="И";  МасРус[10]="Й"; МасРус[11]="К";
    МасРус[12]="Л";  МасРус[13]="М"; МасРус[14]="Н"; МасРус[15]="О"; МасРус[16]="П"; МасРус[17]="Р";
    МасРус[18]="С";  МасРус[19]="Т"; МасРус[20]="У"; МасРус[21]="Ф"; МасРус[22]="Х"; МасРус[23]="Ц";
    МасРус[24]="Ч";  МасРус[25]="Ш"; МасРус[26]="Щ"; МасРус[27]="Ъ"; МасРус[28]="Ы"; МасРус[29]="Ь";
    МасРус[30]="Э";  МасРус[31]="Ю"; МасРус[32]="Я";  

    МасРус[33]="а";  МасРус[34]="б"; МасРус[35]="в"; МасРус[36]="г"; МасРус[37]="д"; МасРус[38]="е";
    МасРус[39]="ё";  МасРус[40]="ж"; МасРус[41]="з"; МасРус[42]="и"; МасРус[43]="й"; МасРус[44]="к";
    МасРус[45]="л";  МасРус[46]="м"; МасРус[47]="н"; МасРус[48]="о"; МасРус[49]="п"; МасРус[50]="р";
    МасРус[51]="с";  МасРус[52]="т"; МасРус[53]="у"; МасРус[54]="ф"; МасРус[55]="х"; МасРус[56]="ц";
    МасРус[57]="ч";  МасРус[58]="ш"; МасРус[59]="щ"; МасРус[60]="ъ"; МасРус[61]="ы"; МасРус[62]="ь";
    МасРус[63]="э";  МасРус[64]="ю"; МасРус[65]="я";  
        
    
    МасКод = Новый Массив(66) ;
    
    МасКод[0]="0410";   МасКод[1]="0411";  МасКод[2]="0412";  МасКод[3]="0413";  МасКод[4]="0414";  МасКод[5]="0415";
    МасКод[6]="0401";   МасКод[7]="0416";  МасКод[8]="0417";  МасКод[9]="0418";  МасКод[10]="0419"; МасКод[11]="041A";
    МасКод[12]="041B";  МасКод[13]="041C"; МасКод[14]="041D"; МасКод[15]="041E"; МасКод[16]="041F"; МасКод[17]="0420";
    МасКод[18]="0421";  МасКод[19]="0422"; МасКод[20]="0423"; МасКод[21]="0424"; МасКод[22]="0425"; МасКод[23]="0426";
    МасКод[24]="0427";  МасКод[25]="0428"; МасКод[26]="0429"; МасКод[27]="042A"; МасКод[28]="042B"; МасКод[29]="042C";
    МасКод[30]="042D";  МасКод[31]="042E"; МасКод[32]="042F";  

    МасКод[33]="0430";  МасКод[34]="0431"; МасКод[35]="0432"; МасКод[36]="0433"; МасКод[37]="0434"; МасКод[38]="0435";
    МасКод[39]="0451";  МасКод[40]="0436"; МасКод[41]="0437"; МасКод[42]="0438"; МасКод[43]="0439"; МасКод[44]="043A";
    МасКод[45]="043B";  МасКод[46]="043C"; МасКод[47]="043D"; МасКод[48]="043E"; МасКод[49]="043F"; МасКод[50]="0440";
    МасКод[51]="0441";  МасКод[52]="0442"; МасКод[53]="0443"; МасКод[54]="0444"; МасКод[55]="0445"; МасКод[56]="0446";
    МасКод[57]="0447";  МасКод[58]="0448"; МасКод[59]="0449"; МасКод[60]="044a"; МасКод[61]="044b"; МасКод[62]="044c";
    МасКод[63]="044d";  МасКод[64]="044E"; МасКод[65]="044F";  
    
	Для Счетчик = 1 По СтрДлина(Строка) Цикл
		Символ = Лев(Строка, 1);
        Индекс = МасРус.Найти(Символ);
		Если Индекс = Неопределено Тогда
			ГотововаяСтрока = ГотововаяСтрока + Символ;
		Иначе
			ГотововаяСтрока = ГотововаяСтрока + "\" + МасКод[Индекс];
		КонецЕсли;
		Строка = Сред(Строка, 2);
    КонецЦикла;   

    Возврат ГотововаяСтрока;
        
КонецФункции

Функция СтрокаИзЧисла(Значение) Экспорт
	
	Возврат СтрЗаменить(Строка(Значение),Символы.НПП,"");
	
КонецФункции

Функция ПолучитьЧислаИзСтроки(Знач Строка) Экспорт
	
	Результат = Новый Массив;
	
	Длина = СтрДлина(Строка);
	
	НачалоЧисла = Ложь;
	ЭтоЧисло = Ложь;
	ИтогЧислоСтрокой = "";
	
	Для Инд = 1 По Длина Цикл
		Символ = Сред(Строка, Инд, 1);
		Попытка
			Если Символ = "." Или Символ = " " Тогда
				ЭтоЧисло = Ложь;
			Иначе
				Число = Число(Символ);
				ЭтоЧисло = Истина;
			КонецЕсли; 		
		Исключение
		    ЭтоЧисло = Ложь; 
		КонецПопытки;
		
		Если ЭтоЧисло Или (Символ = "." И НачалоЧисла) Тогда
			
			ИтогЧислоСтрокой = ИтогЧислоСтрокой + Символ;
			НачалоЧисла = Истина;
			
		ИначеЕсли НачалоЧисла Тогда
			
			Результат.Добавить(Число(?(ИтогЧислоСтрокой = "","0",ИтогЧислоСтрокой)));
			НачалоЧисла = Ложь;
	 
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ПустаяСтрока(ИтогЧислоСтрокой) Тогда
				
		Результат.Добавить(Число(?(ИтогЧислоСтрокой = "","0",ИтогЧислоСтрокой)));
		
	Иначе
		
		Результат.Добавить(0);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НайтиДатуВСтроке(Знач Строка, Исключения = Неопределено) Экспорт
	
	Если Исключения <> Неопределено Тогда
		
		ТипИсключения = ТипЗнч(Исключения);
		Если ТипИсключения = Тип("Массив") Тогда
			ТекущиеИсключения = Исключения;
		ИначеЕсли ТипИсключения = Тип("Число") Тогда 	 
			ТекущиеИсключения = Новый Массив;
			СтрокаИсключение = СтрЗаменить(Строка(Исключения), Символы.НПП, "");
			СтрокаИсключение = СтрЗаменить(СтрокаИсключение, ".", ",");
			ТекущиеИсключения.Добавить(СтрокаИсключение);
		ИначеЕсли ТипИсключения = Тип("Строка") Тогда 	
			ТекущиеИсключения = СтрРазделить(Исключения, ",", Ложь);
		КонецЕсли;
		
	КонецЕсли; 
	
	Для каждого ТекущееИсключение Из ТекущиеИсключения Цикл
		Строка = СтрЗаменить(Строка, ТекущееИсключение, "");
	КонецЦикла; 
	
	День = СлужебныеПроцедурыКлиентСервер.ПолучитьЧислаИзСтроки(Строка)[0];
	ТекДата = ТекущаяДата();
	
	Если День(ТекДата) < День Тогда
		Месяц = Месяц(ТекДата);
		Год = Год(ТекДата);
	Иначе
		Если Месяц(ТекДата) + 1 > 12 Тогда
			Месяц = 1;
			Год = Год(ТекДата) + 1;
		Иначе
			Месяц = Месяц(ТекДата) + 1;
			Год = Год(ТекДата); 
		КонецЕсли; 
	КонецЕсли; 

	Возврат Дата(Год, Месяц, День, 23, 59, 59);
	
КонецФункции

Функция ABS(Значение) Экспорт
	
	Возврат ?(Значение < 0, -Значение, Значение);
	
КонецФункции
 
#КонецОбласти
