Перем ЭтоНовый;

Процедура ПриЗаписи(Отказ)
	
	Если ЭтоНовый Тогда
	 
		ДокДолг = Документы.ПересчетДолга.СоздатьДокумент();
		ДокДолг.Дата = ТекущаяДатаСеанса();
		ДокДолг.Долг = Ссылка;
		ДокДолг.Сумма = Сумма;
		ДокДолг.ИДСообщения = ИДСообщения;
		ДокДолг.Комментарий = Комментарий;
		ДокДолг.Записать(РежимЗаписиДокумента.Проведение);
		
		Если Не НеСоздаватьПоступление Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Пользователи.Ссылка) КАК Количество
			|ИЗ
			|	Справочник.Пользователи КАК Пользователи";
			РезультатЗапроса = Запрос.Выполнить().Выбрать();
			РезультатЗапроса.Следующий();	
			Количество = РезультатЗапроса.Количество;
			
			Пользователи = Справочники.Пользователи.Выбрать();

			СуммаНаОдного = Число(Формат(Сумма / Количество, "ЧДЦ=2"));
			ОстатокСуммы = Сумма;
			Пока Пользователи.Следующий() Цикл
				
				Документы.Операция.СоздатьИЗаполнить(Пользователи.Ссылка, Истина, СуммаНаОдного, Справочники.СтатьиДоходаРасхода.ВзятиеВДолг, Безнал, ТекущаяДатаСеанса());	
				
				ОстатокСуммы = ОстатокСуммы - СуммаНаОдного;
				
			КонецЦикла;
			
			Если ОстатокСуммы <> 0 Тогда
				Документы.Операция.СоздатьИЗаполнить(Пользователи.Ссылка, ?(ОстатокСуммы>0,Истина,Ложь), ?(ОстатокСуммы>0,ОстатокСуммы,ОстатокСуммы * -1), Справочники.СтатьиДоходаРасхода.ВзятиеВДолг, Безнал, ТекущаяДатаСеанса());	
			КонецЕсли;
				
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	ЭтоНовый =  ЭтоНовый();
КонецПроцедуры
