
&НаКлиенте
Процедура ОбработатьДанные(Команда)
	ОбменТелеграмСервер.ОбработатьКоманды();
КонецПроцедуры

&НаКлиенте
Процедура Остатки(Команда)
	ОбменТелеграмСервер.ОтправитьОтчетЗаПериод(Период.ДатаНачала,Период.ДатаОкончания);
КонецПроцедуры

&НаКлиенте
Процедура IAMЯндекс(Команда)
	
	РегламентныеПроцедурыСервер.ОбновитьIAMЯндексРегламент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЧек(Команда)
	Сообщить(ПроверкаЧеков.ПроверитьЧек(ДанныеШтрихкода, ТекПользователь()));
КонецПроцедуры

&НаСервере
Функция ТекПользователь()
	Возврат ПараметрыСеанса.ТекущийПользователь;
КонецФункции

&НаКлиенте
Процедура ОбновитьПроксиAPI(Команда)
	СлужебныеПроцедурыСервер.ОбновитьПрокси();
КонецПроцедуры
 