
&НаКлиенте
Процедура ПроверитьЧек(Команда)
	
	Сообщить(ПроверкаЧеков.ПроверитьЧек(ДанныеШтрихкода, ТекПользователь()));
	
КонецПроцедуры

&НаСервере
Функция ТекПользователь()
	
	Возврат ПараметрыСеанса.ТекущийПользователь;
	
КонецФункции


&НаСервереБезКонтекста
Процедура ОбработатьСообщенияНаСервере()
	
	ОбменТелеграм.ОбработатьКоманды();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСообщения(Команда)
	
	ОбработатьСообщенияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОстаткиНаСервере()
	
	ОбменТелеграм.ОтправитьОтчетЗаПериод(Период.ДатаНачала,Период.ДатаОкончания);
	
КонецПроцедуры

&НаКлиенте
Процедура Остатки(Команда)
	
	ОстаткиНаСервере();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьIAMЯндексНаСервере()
	
	СлужебныеПроцедуры.ОбновитьIAMЯндекс();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьIAMЯндекс(Команда)
	
	ОбновитьIAMЯндексНаСервере();
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ОбновитьПроксиAPIНаСервере()
	
	СлужебныеПроцедуры.ОбновитьПрокси();
	
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьПроксиAPI(Команда)
	
	ОбновитьПроксиAPIНаСервере();
	
КонецПроцедуры
 