
&НаКлиенте
Процедура ПроверитьЧек(Команда)
	
	Сообщить(ПроверкаЧеков.ПроверитьЧек(ДанныеШтрихкода, ТекПользователь()));
	
КонецПроцедуры

&НаСервере
Функция ТекПользователь()
	
	Возврат ПараметрыСеанса.ТекущийПользователь;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ОбработатьСообщенияНаСервере()
	
	ОбменТелеграм.ОбработатьКоманды();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСообщения(Команда)
	
	Если ПостояннаяОбработка Тогда
		ПодключитьОбработчикОжидания("ОбработатьСообщенияОбработчик", 1, Ложь);
	Иначе
		ОбработатьСообщенияНаСервере();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСообщенияОбработчик()
	
	ОбработатьСообщенияНаСервере();
	
КонецПроцедуры
 
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Строка = "Добавить в кошелёк 50 рублей и принисите мне чёрный кофе с двумя ложками сахара и молоком!";
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НейроннаяСеть = Справочники.ЛинейныеНейронныеСети.АнализТекстаСообщения;
	ТекстСообщенияАнализа = "Поступление 10 рублей.";
	
КонецПроцедуры

&НаКлиенте
Процедура ВычислитьВероятности(Команда)
	
	ОчиститьСообщения();
	
	ВычислитьВероятностиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВычислитьВероятностиНаСервере()
	
	ПараметрыПолученияВероятностей = Новый Структура("ЭтоОбучениеНейроннойСети", Истина);
	Вероятности = НейронныеСети.ПолучитьВероятности(НейроннаяСеть, ТекстСообщенияАнализа, ПараметрыПолученияВероятностей);
	
	Если Вероятности = Неопределено Тогда
		Сообщить("Ошибка: нейросеть не обучена полностью");
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаВероятность Из Вероятности Цикл
		
		Сообщить("" + СтрокаВероятность.Нейрон + " -- " + СтрокаВероятность.Вероятность);
		
	КонецЦикла; 
	
КонецПроцедуры

