
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.Долги.Записывать = Истина;
	Движение = Движения.Долги.Добавить();
	Движение.ВидДвижения = ?(Сумма < 0, ВидДвиженияНакопления.Расход, ВидДвиженияНакопления.Приход);
	Движение.Долг = Долг;
	Движение.Период = Дата;
	Движение.Выдавший = Долг.Выдавший;
	Движение.Сумма = ?(Сумма < 0, Сумма * -1, Сумма);

КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если Сумма < 0 Тогда
		 	Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ДолгиОстатки.СуммаОстаток КАК СуммаОстаток
			|ИЗ
			|	РегистрНакопления.Долги.Остатки(&МоментВремени, Выдавший = &Выдавший) КАК ДолгиОстатки";
			Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
			Запрос.УстановитьПараметр("Выдавший", Долг.Выдавший);
			РезультатЗапроса = Запрос.Выполнить();
			Если РезультатЗапроса.Пустой() Тогда
				Остаток = 0;
			Иначе
				Выборка = РезультатЗапроса.Выбрать();
				Выборка.Следующий();
				Остаток = Выборка.СуммаОстаток;
			КонецЕсли; 			
			
			Если Остаток < Сумма * -1 Тогда
				Отказ = Истина;
				Сообщить("Сумма списания больше суммы оставшегося долга!");
			КонецЕсли; 
			
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

