Функция РасчитатьЗатратыДоЗарплаты(ДатаОтсчетаАнализа = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СредстваОстатки.СуммаОстаток, 0) / РАЗНОСТЬДАТ(&ТекДата, ПолучениеЗарплатыСрезПервых.Период, ДЕНЬ) КАК ЗатратыНаДень
	|ИЗ
	|	РегистрНакопления.Средства.Остатки(" + ?(ЗначениеЗаполнено(ДатаОтсчетаАнализа),"&ДатаАнализа","") + ", ) КАК СредстваОстатки,
	|	РегистрСведений.ПолучениеЗарплаты.СрезПервых КАК ПолучениеЗарплатыСрезПервых
	|ГДЕ
	|	НЕ ПолучениеЗарплатыСрезПервых.Период ЕСТЬ NULL
	|	И ПолучениеЗарплатыСрезПервых.Сумма <> 0";
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ДатаАнализа", ДатаОтсчетаАнализа);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
	    Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат ?(ЗначениеЗаполнено(Выборка.ЗатратыНаДень),Выборка.ЗатратыНаДень,0);
	КонецЕсли; 	
	 	
КонецФункции
