
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.КоличествоУниграмм.Заголовок = "Количество униграмм: " + СлужебныеПроцедуры.КоличествоЭлементовТаблицы("Справочник.Униграммы");
	 
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзФайла(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Показать(Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		
		ДобавитьИзФайлаНаСервере(ВыбранноеЗначение);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьИзФайлаНаСервере(ИменаФайлов)

	Для каждого ИмяФайла Из ИменаФайлов Цикл
		
		ТекДок = Новый ТекстовыйДокумент;
		ТекДок.Прочитать(ИмяФайла, КодировкаТекста.UTF8);
		
		КоличествоСтрок = ТекДок.КоличествоСтрок();
		
		Для Индекс = 1 По КоличествоСтрок Цикл
			
			ТекСтрока = ТекДок.ПолучитьСтроку(Индекс);
			Если СтрНайти(ТекСтрока, "--------") <> 0 Или СтрНайти(ТекСтрока, "++++++++") <> 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ТекСтрока) Тогда
				Справочники.Униграммы.ДобавитьУниграммыВСловарь(ТекСтрока);
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЦикла; 
		
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьВекторы(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВопросЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, "При заполнении векторов потребуется переобучение нейронных сетей. Продолжить?",РежимДиалогаВопрос.ДаНет, 60);
	 
КонецПроцедуры
 
&НаКлиенте
Процедура ВопросЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		НейронныеСетиВызовСервера.ЗаполнитьВекторыСловаря("Справочник.Униграммы");
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзНейроннойСети(Команда)
	
	ПоказатьВводЗначения(Новый ОписаниеОповещения("ВводНейроннойСетиЗавершение", ЭтотОбъект), Неопределено, "Выберите элемент", Тип("СправочникСсылка.ЛинейныеНейронныеСети"));
	
КонецПроцедуры

&НаКлиенте
Процедура ВводНейроннойСетиЗавершение(Значение, ДополнительныеПараметры) Экспорт
	
	Если Значение <> Неопределено Тогда
		
		ДобавитьУниграммыИзФайлаОбученияНейроннойСети(Значение);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьУниграммыИзФайлаОбученияНейроннойСети(НейроннаяСеть)

	Справочники.Униграммы.ДобавитьУниграммыИзФайлаОбученияНейроннойСети(НейроннаяСеть);
	
КонецПроцедуры 